# Panda

# 1 - Series

In [2]:
import pandas as pd

my_series = pd.Series([1, 2, 3,4,5],index=['row1','row2','row3','row4','row5'])
my_series

row1    1
row2    2
row3    3
row4    4
row5    5
dtype: int64

In [7]:
#Show Values
my_series.values

array([1, 2, 3, 4, 5], dtype=int64)

In [12]:
#Show index
b=my_series.index
print(b)

#Select index
my_series.row2
e=my_series['row2']
print(e)

#Boolean indexing
d=my_series[my_series>3]
print(d)

Index(['row1', 'row2', 'row3', 'row4', 'row5'], dtype='object')
2
row4    4
row5    5
dtype: int64

In [13]:
#Example : Set alphabet label as new index
my_series.index = ['A','B','C','D','E']
my_series

A    1
B    2
C    3
D    4
E    5
dtype: int64

# 2 - DataFrame

In [19]:
#Create DataFrame with Array
import numpy as np
import pandas as pd

my_array = np.array([[1 ,5 ,9 ,13],[2 ,6 ,10 ,14],[3 ,7 ,11 ,15],[4 ,8 ,12 ,16]])
my_df = pd.DataFrame(my_array,index=['row1' ,'row2' ,'row3' ,'row4'],columns=['col1' ,'col2' ,'col3' ,'col4'])
my_df

      col1  col2  col3  col4
row1     1     5     9    13
row2     2     6    10    14
row3     3     7    11    15
row4     4     8    12    16

In [20]:
#Create DataFrame with Dictionary

my_dict = {'col1':[1,2,3,4],'col2':[5,6,7,8],'col3':[9,10,11,12],'col4':[13,14,15,19]}
my_df = pd.DataFrame(my_dict, index=['row1','row2','row3','row4'])
my_df

      col1  col2  col3  col4
row1     1     5     9    13
row2     2     6    10    14
row3     3     7    11    15
row4     4     8    12    19

In [21]:
my_df.index

Index(['row1', 'row2', 'row3', 'row4'], dtype='object')

In [22]:
my_df.columns

Index(['col1', 'col2', 'col3', 'col4'], dtype='object')

In [23]:
my_df.values

array([[ 1,  5,  9, 13],
       [ 2,  6, 10, 14],
       [ 3,  7, 11, 15],
       [ 4,  8, 12, 19]], dtype=int64)

In [24]:
my_df.loc['row1'][:]

col1     1
col2     5
col3     9
col4    13
Name: row1, dtype: int64

In [25]:
my_df.iloc[0][:]

col1     1
col2     5
col3     9
col4    13
Name: row1, dtype: int64

In [27]:
#Edit a DataFrame

my_df['col5'] = [20 ,21 ,22 ,23]
my_df

      col1  col2  col3  col4  col5
row1     1     5     9    13    20
row2     2     6    10    14    21
row3     3     7    11    15    22
row4     4     8    12    19    23

In [28]:
my_df.loc[['row1','row2'],'col1'] = 0
my_df

      col1  col2  col3  col4  col5
row1     0     5     9    13    20
row2     0     6    10    14    21
row3     3     7    11    15    22
row4     4     8    12    19    23

In [29]:
#Reset Index

my_df.reset_index(drop=True)

   col1  col2  col3  col4  col5
0     0     5     9    13    20
1     0     6    10    14    21
2     3     7    11    15    22
3     4     8    12    19    23

In [30]:
#Deleting

my_df.drop('col5',axis=1)

      col1  col2  col3  col4
row1     0     5     9    13
row2     0     6    10    14
row3     3     7    11    15
row4     4     8    12    19

In [31]:
#Renaming

my_df.rename(columns={'col4':'col_four'})

      col1  col2  col3  col_four  col5
row1     0     5     9        13    20
row2     0     6    10        14    21
row3     3     7    11        15    22
row4     4     8    12        19    23

In [33]:
#Replacing

my_df.replace({0:1},regex=True)

      col1  col2  col3  col4  col5
row1     1     5     9    13    20
row2     1     6    10    14    21
row3     3     7    11    15    22
row4     4     8    12    19    23

In [45]:
#Apply function on index

my_df.col1 = ['{:3.2f}'.format(x) for x in my_df.iloc[:,0] ]
my_df

ValueError: Unknown format code 'f' for object of type 'str'

In [46]:
my_df['col2'] = my_df['col2'].apply(lambda x:'{0:3.2f}'.format(x))
my_df

ValueError: Unknown format code 'f' for object of type 'str'

In [47]:
#Sorting
  #sort index
    
my_df.sort_index(axis=1,ascending=False)

      col5  col4  col3  col2  col1
row1    20    13     9  5.00  0.00
row2    21    14    10  6.00  0.00
row3    22    15    11  7.00  3.00
row4    23    19    12  8.00  4.00

In [48]:
#sort values

my_df.sort_values(by='col1',ascending=False)

      col1  col2  col3  col4  col5
row4  4.00  8.00    12    19    23
row3  3.00  7.00    11    15    22
row1  0.00  5.00     9    13    20
row2  0.00  6.00    10    14    21

In [50]:
#متد بررسی انتها و ابتدای دیتافریم

#Methods head نمایش دو سطر ابتدایی

my_df.head(2)

      col1  col2  col3  col4  col5
row1  0.00  5.00     9    13    20
row2  0.00  6.00    10    14    21

In [51]:
#Methods tail نمایش دو سطر انتهایی

my_df.tail(2)

      col1  col2  col3  col4  col5
row3  3.00  7.00    11    15    22
row4  4.00  8.00    12    19    23

# imort data

In [62]:
#read csv by panda

data=pd.read_csv('F://22.csv') 
data

                    english               farsi
0                     a few                 کمي
1           a great deal of             يک دنيا
2                 a handful              يک مشت
3             a la garconne            آلاگارسن
4                  a little              اندکيی
5                  a little                 کمي
6                  a little               اندکي
7                  a little                کمکي
8                  a little               اندکي
9      a little while later           اندکي بعد
10                    a lot         بمقدار زياد
11                    a lot                 کلي
12                 a lot of         مقدار زيادي
13                 a lot of              بسياري
14             a section of             قشري از
15                  a while               اندکي
16              a while ago            چندي قبل
17            a while later            مدتي بعد
18                     A.D.              ميلادي
19                      aba                 عبا
20                   abacus                چرکه
21                   abacus                چتکه
22                   Abadan              آبادان
23                     Aban                آبان
24                  abandon            رهاساختن
25                  abandon           دست کشيدن
26                  abandon             دل کندن
27                  abandon             ترککردن
28                  abandon            رها کردن
29                  abandon         صرفنظر کردن
...                     ...                 ...
71265                  zone     ناحيه دسته بندي
71266                   zoo             باغ وحش
71267           zoo ecology     بومشناسي حيواني
71268         zoo geography     جغرافياي حيواني
71269                 zooid                زيوه
71270             zoologist  ويژه گر جانورشناسي
71271             zoologist           جانورشناس
71272             zoologist           جانورشناس
71273               zoology         جانور شناسي
71274                  zoom                 زوم
71275            zoomorphic          شبيه جانور
71276            zoomorphic            جانورسان
71277               zootomy         جانور شکافي
71278             Zoroaster               زردشت
71279             Zoroaster               زرتشت
71280           zoroastrian              زرتشتي
71281           Zoroastrian              زردشتي
71282           Zoroastrian              زردشتي
71283           zoroastrian              زرتشتي
71284    zoroastrian priest               هيربد
71285                  Zoya                زويا
71286                  Zulu              ناتالي
71287                  Zulu              ناتالي
71288                Zurich               زوريخ
71289                zygote           سلول نطفه
71290              zymology           مخمرشناسي
71291           zymoplastic        مولد دياستاز
71292           zymoplastic           آنزيمسازي
71293               zymurgy          تخميرشناسي
71294                  Zyvr                زيور

[71295 rows x 2 columns]